{"title":"Career Profile Introductions","id":14878299,"template":"Career Profile Introductions","folder":"WorkBC Introductory Blurbs","status":"Published","Salary Introduction":"<p>Earnings is income that workers receive in exchange for their labour. Depending on the type of employment, earnings can be in the form of wages (hourly), salaries (fixed monthly or annual) or self-employed earnings.<\/p>","Skills Introduction":"<p>Every job calls for a certain set of skills. Knowing those skills is the first step in finding a good career fit.<\/p><p>Here, you will find the 10 most relevant workplace skills. Some are more important to achieving success in a certain career than others. These skills may come naturally to you or you may need to gain them through education, training and experience.<\/p><p>See the list of work-related skills below, ranked in order of importance for this career. Check out the list and see if this career matches your skills—take that first step!<\/p>","Labour Market Statistics Introduction":"<p>Discover data, facts and information that have been gathered and analyzed. Learn about the characteristics of the economy and labour market in B.C.<\/p>","Employment Introduction":"<p>Find out about employment types and trends by region and industry.<\/p>","Labour Market Outlook Introduction":"<p>The B.C. Labour Market Outlook is a 10-year forecast of the expected supply and demand for labour in the province. It’s usually updated every year. The purpose is to provide British Columbians with the knowledge to make informed decisions on careers, skills training, education and hiring.<\/p>","Industry Highlights Introduction":"<p>Learn about the opportunities in B.C.'s major industries, including employment trends, earning potential, locations of work and more.<\/p>","Occupational Interests Introduction":"<p>It’s important to understand what kinds of occupations align with your interests.<\/p><p>Here are the top occupational interests for this career profile:<br\/><br\/>For more about occupational interests visit https:\/\/number41media1.gathercontent.com\/item\/14607011.<\/p>"}
