[
{
    "Page Title": "Accommodation, travel, tourism and related services supervisors",
    "Banner Image": [],
    "NOC": " (NOC 6313)",
    "Career Overview Content": "<p><strong>Supervisors in this unit group:<\/strong><\/p><ul><li>Supervise and coordinate the activities of hotel accommodation service clerks, theatre ushers and attendants, reservation clerks, sports and recreation club workers, commissionaires, security guards and other service workers not elsewhere classified<\/li><li>Work for service establishments throughout the public and private sectors<br\/><\/li><\/ul>",
    "Duties Content": "<p><strong>Accommodation, travel, tourism and related services supervisors perform some or all of the following duties:<\/strong><\/p><ul><li>Co-ordinate, assign and review the work of hotel, motel and other accommodation services clerks, casino workers, reservation clerks and other travel and accommodations workers not elsewhere classified<\/li><li>Create work schedules and procedures and coordinate activities with other work units or departments<\/li><li>Solve work-related problems and prepare and submit progress and other reports<\/li><li>Hire and train staff in job duties, safety procedures and company policies<\/li><li>Order supplies and materials<\/li><li>Make sure computer systems, equipment and machinery operate properly, and arrange maintenance and repair work<\/li><li>May perform the same duties as workers supervised<\/li><\/ul><p><\/p>",
    "Additional Duties List": "",
    "Salary Content": "<p>Earnings is income that workers receive in exchange for their labour. Depending on the type of employment, earnings can be in the form of wages (hourly), salaries (fixed monthly or annual) or self-employed earnings.<\/p>",
    "Work Environment Content": "<p><strong>Key aspects of the work in this occupation:<\/strong><\/p><ul><li>Work takes place in a normal indoor environment.<\/li><li>Work may also take place outdoors in various weather conditions.<\/li><\/ul>",
    "Career Pathways Content": "<p>At this time, career path information is not available for this occupation.<\/p>",
    "Related Careers Content": "<ul><li><a href=\"https:\/\/www.workbc.ca\/Jobs-Careers\/Explore-Careers\/Browse-Career-Profile\/0632\" >Accommodation service managers (NOC 0632)<\/a><\/li><li><a href=\"https:\/\/www.workbc.ca\/Jobs-Careers\/Explore-Careers\/Browse-Career-Profile\/6311\" >Food service supervisors (NOC 6311)<\/a><\/li><\/ul>",
    "Related Careers NOCs": "NOC 0632\nNOC 6311",
    "Occupational Interests Content": "<p>It’s important to understand what kinds of occupations align with your interests.<\/p><p>Here are the top occupational interests for this career profile:<\/p>",
    "Job Titles List": "Baggage handler \/ porter\nBell captain\nCasino\nClerks\nCustomer relations supervisor - casino\nGuest service supervisor - casino\nHotel staff\nManaging\nPassenger service co-ordinator\nReservations\nSales and service agents",
    "Career Video URLs": "",
    "Career Videos Content": "",
    "Career Video Link": [
        ""
    ],
    "Education, Training and Skills Content": "<ul><li>Completion of secondary school is usually required.<\/li><li>Completion of college courses related to the area supervised may be required.<\/li><li>Experience in the occupation supervised is usually required.<\/li><\/ul>",
    "Education Programs in B.C. Content": "<p>The following program areas are related to this occupation:<\/p><ul><li>Academic\/Basic Upgrading<\/li><\/ul>",
    "Skills Content": "<p>Every job calls for a certain set of skills. Knowing those skills is the first step in finding a good career fit.<\/p><p>Here, you will find the 10 most relevant workplace skills. Some are more important to achieving success in a certain career than others. These skills may come naturally to you or you may need to gain them through education, training and experience.<\/p><p>See the list of work-related skills below, ranked in order of importance for this career. Check out the list and see if this career matches your skills—take that first step!<\/p>",
    "Labour Market Statistics Content": "<p><span>Discover data, facts and information that have been gathered and analyzed. Learn about the characteristics of the econo<\/span>my and labour market i<span>n B.C.<\/span><\/p>",
    "Employment Content ": "<p>Find out about employment types and trends by region and industry.<\/p>",
    "Labour Market Outlook Content": "<p>The B.C. Labour Market Outlook is a 10-year forecast of the expected supply and demand for labour in the province. It’s updated every year. The purpose is to provide British Columbians with the knowledge to make informed decisions on careers, skills training, education and hiring.<\/p>",
    "Industry Highlights Content": "<p>Learn about the opportunities in B.C.'s major industries, including employment trends, earning potential, locations of work and more.<\/p>",
    "Insights from Industry Content": "",
    "Resources": [
        {
            "Resource Title": "",
            "Resource Link": ""
        }
    ]
},
{
    "Page Title": "Early childhood educators and assistants",
    "Banner Image": [],
    "NOC": "(NOC 4214)",
    "Career Overview Content": "<p>Early childhood educators (ECEs) work with young children from birth to age five. They create and run educational programs that fuel children’s intellectual, physical, social and emotional growth. Early childhood educator assistants (ECEAs) work under the supervision of ECEs.<\/p>",
    "Duties Content": "<p>Early childhood educators (ECEs) and assistants (ECEAs) work hands-on with children to:<\/p><ul><li>Teach with stories, music, play, field trips, art, drama and movement<\/li><li>Help each child participate and succeed<\/li><li>Protect children’s health and safety<\/li><li>Help children learn good eating, dressing and toileting habits<\/li><li>Help each child build their sense of identity and belonging<\/li><li>Observe and value each child’s way of expressing themselves<\/li><li>Assess learning and development<\/li><li>Deal with signs of learning, development and behavioural issues<\/li><li>Provide fair but firm discipline<\/li><li>Respect the culture of all children<\/li><li>Work with Indigenous children in ways that are respectful and attentive<\/li><\/ul><p>They also:<\/p><ul><li>Do paperwork and keep records<\/li><li>Develop teaching aids and projects<\/li><li>Maintain and clean equipment<\/li><li>Prepare food<\/li><li>Create indoor and outdoor spaces for play and learning<\/li><li>Evaluate educational programs<\/li><li>Take part in professional development<\/li><li>Build relationships with co-workers, children’s families and community services<\/li><li>Communicate regularly with parents and guardians<\/li><\/ul><p>ECEs may also supervise and mentor others, including ECEAs and students.<\/p><p>ECEs and ECEAs use the B.C. Early Learning Framework to guide their work. They must keep up the standards set out in B.C.’s Child Care Licensing Regulation.<\/p>",
    "Additional Duties List": "",
    "Salary Content": "<p>Earnings is income that workers receive in exchange for their labour. Depending on the type of employment, earnings can be in the form of wages (hourly), salaries (fixed monthly or annual) or self-employed earnings.<\/p>",
    "Work Environment Content": "<p>Most early childhood educators (ECEs) and assistants (ECEAs) work in licensed settings such as child-care centres, StrongStart BC centres, before- and after-school programs or preschool programs. These can be located in schools, community centres or workplaces that offer child care to their employees. The work is varied, depending on the setting.<\/p><p>ECEs and ECEAs may work full time or part time, and hours can vary. Preschool and school-based programs usually run during the school year. Most child-care centres are open all year. They may have longer hours or use staggered shifts to fit the needs of working parents. There is a growing demand, for example, for late-night child care by parents who work shifts.<\/p><p>Working with young children and families can be very rewarding. It can also be physically and emotionally demanding. Workers may suffer back strain or other discomfort from time spent standing, walking, sitting on the floor, bending and lifting. They can be exposed to illness by sick children, as well as to challenging issues in the classroom.<\/p>",
    "Career Pathways Content": "<p>Career paths<\/p><p>Recent graduates often find jobs in child-care centres, preschools, community centres or parks and recreation departments. They may be hired as early childhood educators (ECEs) or assistants (ECEAs), support workers for children needing extra help, or before- and after-school programmers.<\/p><p>With more education, ECEAs can become ECEs.<\/p><p>Experienced ECEs can manage programs within an agency or become an agency’s executive director. Some operate private child-care facilities. Those with more education may become infant development consultants, supported child development co-ordinators, child-care directors, administrators for early childhood education centres, or ECE instructors in colleges or universities. Some may choose to train to work as educational assistants with school-aged children.<\/p><p><\/p>",
    "Related Careers Content": "<p><a href=\"https:\/\/www.workbc.ca\/Jobs-Careers\/Explore-Careers\/Browse-Career-Profile\/4032\"  target=\"_blank\" rel=\"noopener noreferrer\">Elementary school and kindergarten teachers (NOC 4032)<\/a><\/p><p><a href=\"https:\/\/www.workbc.ca\/Jobs-Careers\/Explore-Careers\/Browse-Career-Profile\/4413\"  target=\"_blank\" rel=\"noopener noreferrer\">Elementary and secondary school teacher assistants (NOC 4413)<\/a><\/p><p><\/p>",
    "Related Careers NOCs": "NOC 4032\nNOC 4413",
    "Occupational Interests Content": "<p>It’s important to understand what kinds of occupations align with your interests.<\/p><p>Here are the top occupational interests for this career profile:<\/p><p><\/p>",
    "Job Titles List": "Aide \/ worker - daycare \/ nursery school\nDaycare assistant \/ attendant\nEarly childhood program assistant\nECE (early childhood educator)",
    "Career Video URLs": "https:\/\/youtu.be\/-qxLEZwlUHs",
    "Career Videos Content": "<p>Watch the video below to see what a day in the life of an early childhood educator is like.<\/p>",
    "Career Video Link": [
        ""
    ],
    "Education, Training and Skills Content": "<p>Early childhood educators (ECEs) and assistants (ECEAs) must be certified in order to work in most licensed child-care programs. There are five levels of certification:<\/p><p>ECE – one year<\/p><p>ECE – five year<\/p><p>ECEA<\/p><p>Infant Toddler Educator (ITE)<\/p><p>Special Needs Educator (SNE)<\/p><p>ECEs must complete an early childhood education program at a recognized university or college. They can then be certified through the B.C. Ministry of Children and Family Development. ECEAs can earn a certificate after taking courses in child development, children’s well-being and curriculum planning. ITEs and SNEs must be certified as ECEs before taking their additional training and certification.<\/p><p>To stay certified, workers must continue to do professional development, get work experience and meet character and skill requirements.<\/p><p>The ECE Education Support Fund offers grants for professional development and education.<\/p><p>ECEs who are certified for that occupation by a regulator elsewhere in Canada can apply for the same certification from the regulator in B.C. Under the terms of the <a href=\"https:\/\/www.cfta-alec.ca\/\"  target=\"_blank\" rel=\"noopener noreferrer\">Canadian Free Trade Agreement (CFTA)<\/a>, most applicants who are transferring their credentials from elsewhere in Canada will not be required to complete additional training or testing. However, the B.C. regulator may ask applicants to provide further information such as a letter of good standing, references, or criminal record check.<\/p><p>For those who trained outside of Canada and never received certification from any Canadian jurisdiction, a full assessment is likely needed. Most occupational regulators have a process for assessment and recognize internationally trained applicants.<\/p><p>Contact the <a href=\"https:\/\/www2.gov.bc.ca\/gov\/content\/education-training\/early-learning\/teach\/training-and-professional-development\/become-an-early-childhood-educator\"  target=\"_blank\" rel=\"noopener noreferrer\">B.C. Ministry of Children and Family Development: Early Childhood Educator Registry<\/a> for details on how to apply for certification in B.C.<\/p><p>For information about labour mobility in Canada, visit <a href=\"http:\/\/www.workersmobility.ca\/\"  target=\"_blank\" rel=\"noopener noreferrer\">www.workersmobility.ca<\/a>.<\/p><p>View a list of <a href=\"https:\/\/www.workbc.ca\/Jobs-Careers\/Explore-Careers\/B-C-Occupational-Regulators.aspx\"  target=\"_blank\" rel=\"noopener noreferrer\">B.C. occupational regulators<\/a>.<\/p>",
    "Education Programs in B.C. Content": "<p>The following program areas are related to this occupation:<\/p><ul><li>Early Childhood Education<\/li><li>Teacher Assistant\/Aide<\/li><\/ul><p><\/p><p><\/p>",
    "Skills Content": "<p>Every job calls for a certain set of skills. Knowing those skills is the first step in finding a good career fit.<\/p><p>Here, you will find the 35 most relevant workplace skills. Some are more important to achieving success in a certain career than others. These skills may come naturally to you or you may need to gain them through education, training and experience.<\/p><p>See the list of work-related skills below, ranked in order of importance for this career. You’ll also find the skill strength needed, letting you know how capable you must be in that skill.<\/p><p>Check out the list and see if this career matches your skills—take that first step!<\/p>",
    "Labour Market Statistics Content": "<p>Discover data, facts and information that have been gathered and analyzed. Learn about the characteristics of the economy and labour market in B.C.<\/p>",
    "Employment Content ": "<p>Find out about employment types and trends by region and industry.<\/p>",
    "Labour Market Outlook Content": "<p>The B.C. Labour Market Outlook is a 10-year forecast of the expected supply and demand for labour in the province. It’s updated every year. The purpose is to provide British Columbians with the knowledge to make informed decisions on careers, skills training, education and hiring.<\/p>",
    "Industry Highlights Content": "<p>Learn about the opportunities in B.C.'s major industries, including employment trends, earning potential, locations of work and more.<\/p>",
    "Insights from Industry Content": "<p>This work can be challenging and the pay can be low. This leads to a high turnover of workers and regular vacancies.<\/p><p>Rural areas continue to have a shortage of qualified workers. Educators certified to work with children with special needs, infants or toddlers are also in especially high demand.<\/p><p>In addition, the B.C. government has committed to significantly increase the number of child-care spaces across the province. As a result, 8,600 more early childhood educators will likely be needed over the next decade.<\/p>",
    "Resources": [
        {
            "Resource Title": "",
            "Resource Link": ""
        }
    ]
},
{
    "Page Title": "Economists and economic policy researchers and analysts",
    "Banner Image": [],
    "NOC": "(NOC 4162)",
    "Career Overview Content": "<p>Economists and economic policy researchers and analysts do research, follow data, analyze information and prepare reports and plans to solve economic and business problems. They develop models to analyze, explain and forecast economic behaviour and patterns and advise on:<\/p><ul><li>Finance<\/li><li>Fiscal and monetary policy<\/li><li>International trade<\/li><li>Agricultural and natural resource commodities<\/li><li>Labour and industrial markets<\/li><\/ul><p>People in this occupational group work for government departments and agencies and throughout the private sector in associations, unions, research organizations, banks and investment firms.<\/p>",
    "Duties Content": "<p><strong>Economists and economic policy researchers and analysts perform some or all of the following duties:<\/strong><\/p><ul><li>Do research and develop models to analyze, explain and forecast economic behaviour and patterns, and create methods for collection and analysis of data<\/li><li>Forecast production and consumption of specific products and services based on records of past production and consumption and general economic and industry-specific conditions<\/li><li>Prepare forecasts of income and expenditure, interest rates and exchange rates<\/li><li>Analyze factors that determine economic growth and advise government agencies on policies to increase economic activities<\/li><li>Analyze factors that determine labour force participation, employment, wages, unemployment and other labour market outcomes<\/li><li>Study mathematical formulas and statistical techniques and apply them to the testing and measuring of economic theories and the solution of economic problems<\/li><li>Study the nature of money, credit and the operation of banks and other financial institutions to develop monetary policies and forecasts of financial activity<\/li><li>Follow economic data to assess the effectiveness, and advise on the appropriateness of monetary and fiscal policies<\/li><li>Examine problems related to the economic activity of individual companies<\/li><li>Examine financial methods, production costs and techniques and marketing policies to recommend possible improvements<\/li><li>Examine statistical data on the exchange of goods and services among nations<\/li><li>Forecast production and consumption of renewable resources and supply, consumption and depletion of non-renewable resources<\/li><li>Do research on market conditions in local, regional or national area to set sales and pricing levels for goods and services, to assess market potential and future trends and to develop business strategies<\/li><li>Follow regional and local economic trends<\/li><li>Study regulatory processes and provide material in support of legal proceedings with government and other parties<\/li><\/ul>",
    "Additional Duties List": "",
    "Salary Content": "<p>Earnings is income that workers receive in exchange for their labour. Depending on the type of employment, earnings can be in the form of wages (hourly), salaries (fixed monthly or annual) or self-employed earnings.<\/p>",
    "Work Environment Content": "<p><strong>Key aspects of the work in this occupation:<\/strong><\/p><ul><li>Work takes place in a conventional indoor office setting.<\/li><\/ul>",
    "Career Pathways Content": "<p>Progression to managerial positions in economics is possible with experience.<\/p>",
    "Related Careers Content": "<ul><li><a href=\"https:\/\/www.workbc.ca\/Jobs-Careers\/Explore-Careers\/Browse-Career-Profile\/0412\" >Government managers - economic analysis, policy development and program administration (NOC 0412)<\/a><\/li><li><a href=\"https:\/\/www.workbc.ca\/Jobs-Careers\/Explore-Careers\/Browse-Career-Profile\/1112\" >Financial and investment analysts (NOC 1112)<\/a><\/li><li><a href=\"https:\/\/www.workbc.ca\/Jobs-Careers\/Explore-Careers\/Browse-Career-Profile\/4011\" >University professors and lecturers (NOC 4011)<\/a><\/li><li><a href=\"https:\/\/www.workbc.ca\/Jobs-Careers\/Explore-Careers\/Browse-Career-Profile\/4163\" >Business development officers and marketing researchers and consultants (NOC 4163)<\/a><\/li><li><a href=\"https:\/\/www.workbc.ca\/Jobs-Careers\/Explore-Careers\/Browse-Career-Profile\/4164\" >Social policy researchers, consultants and program officers (NOC 4164)<\/a><\/li><\/ul><p><\/p>",
    "Related Careers NOCs": "NOC 0412\nNOC 1112\nNOC 4011\nNOC 4163",
    "Occupational Interests Content": "<p>It’s important to understand what kinds of occupations align with your interests.<\/p><p>Here are the top occupational interests for this career profile:<\/p>",
    "Job Titles List": "Adviser, consumer - economics\nAnalyst, risk management\nAnalyst, salary \/ wage - economic policy\nAnalyst, trade\nBusiness intelligence analyst\nEconometrician\nEconomist, business\nEconomist, development\nEconomist, energy\nEconomist, farm\nEconomist, financial\nEconomist, health\nEconomist, human resources\nEconomist, mathematical\nEconomist, price\nEconomist, regional economist\nEconomist, social\nEconomist, tax\nEconomist, transport\nEconomist, welfare",
    "Career Video URLs": "https:\/\/youtu.be\/lklBAFlCvwU",
    "Career Videos Content": "<p>Watch the video below to see what it's like to be a chief economist.<\/p>",
    "Career Video Link": [
        ""
    ],
    "Education, Training and Skills Content": "<ul><li>A master's degree in economics or in a related discipline such as business administration or statistics is usually required.<\/li><li>A doctorate in economics may be required.<\/li><\/ul>",
    "Education Programs in B.C. Content": "<p>The following program areas are related to this occupation:<\/p><ul><li>Economics<\/li><li>Economics (Arts)<\/li><li>Economics (Science)<\/li><\/ul>",
    "Skills Content": "<p>Every job calls for a certain set of skills. Knowing those skills is the first step in finding a good career fit.<\/p><p>Here, you will find the 35 most relevant workplace skills. Some are more important to achieving success in a certain career than others. These skills may come naturally to you or you may need to gain them through education, training and experience.<\/p><p>See the list of work-related skills below, ranked in order of importance for this career. You’ll also find the skill strength needed, letting you know how capable you must be in that skill.<\/p><p>Check out the list and see if this career matches your skills—take that first step!<\/p>",
    "Labour Market Statistics Content": "<p>Discover data, facts and information that have been gathered and analyzed. Learn about the characteristics of the economy and labour market in B.C.<\/p>",
    "Employment Content ": "<p>Find out about employment types and trends by region and industry.<\/p>",
    "Labour Market Outlook Content": "<p>The B.C. Labour Market Outlook is a 10-year forecast of the expected supply and demand for labour in the province. It’s updated every year. The purpose is to provide British Columbians with the knowledge to make informed decisions on careers, skills training, education and hiring.<\/p>",
    "Industry Highlights Content": "<p>Learn about the opportunities in B.C.'s major industries, including employment trends, earning potential, locations of work and more.<\/p>",
    "Insights from Industry Content": "",
    "Resources": [
        {
            "Resource Title": "",
            "Resource Link": ""
        }
    ]
},
{
    "Page Title": "Editors",
    "Banner Image": [],
    "NOC": "(NOC 5122)",
    "Career Overview Content": "<p>Editors review, evaluate and edit manuscripts, articles, news reports and other material for publication, broadcast or interactive media and co-ordinate the activities of writers, journalists and other staff.<\/p><p>Editors work for:<\/p><ul><li>Publishing firms<\/li><li>Magazines<\/li><li>Journals<\/li><li>Newspapers<\/li><li>Radio and television networks and stations<\/li><li>Companies and government departments that produce publications such as newsletters, handbooks, manuals and websites<\/li><\/ul><p>They may also work on a freelance basis.<\/p><p>Editors must have excellent writing and communication skills. They must also have highly developed computer skills, be adaptable and able to work with online content.<\/p>",
    "Duties Content": "<p><strong>Editors:<\/strong><\/p><ul><li>Evaluate the suitability of manuscripts, articles, news copy and wire service dispatches for publication, broadcast or electronic media and recommend or make changes in content, style and organization<\/li><li>Read and edit copy to be published or broadcast to identify and correct errors in spelling, grammar and syntax, and shorten or lengthen copy as required<\/li><li>Talk to authors, staff writers, reporters or freelance writers about copy revisions<\/li><li>Plan and do copy layout according to space or time allocations and the copy significance<\/li><li>Plan and coordinate staff activities and make sure productions deadlines are met<\/li><li>Collaborate with senior staff, freelance photographers and writers, graphic designers, advertising sales representatives and printing companies<\/li><li>Plan coverage of coming events and assign work accordingly<\/li><li>Write or prepare introductions, marketing and promotional materials, biographical notes, indexes and other text<\/li><li>May negotiate royalties with authors and arrange payment of freelance staff<\/li><\/ul><h2>Special duties<\/h2><p>Editors may specialize in a particular subject area or type of publication, such as: news, sports or features, books, magazines, newspapers or manuals.<\/p>",
    "Additional Duties List": "",
    "Salary Content": "<p>Earnings is income that workers receive in exchange for their labour. Depending on the type of employment, earnings can be in the form of wages (hourly), salaries (fixed monthly or annual) or self-employed earnings.<\/p>",
    "Work Environment Content": "<p>Editors typically work in office buildings, while freelance and contract editors often work from home offices. Editors work for a wide range of employers, including newspapers, television newsrooms, government and publishing firms.<\/p><p>A 35 to 40 hour workweek is common, however, editors may be required to work extra hours, sometimes on evenings or weekends, in order to meet deadlines. Looming deadlines may cause stress.<\/p><p>Editing is usually done using computers so eye and wrist strain are possible.<\/p>",
    "Career Pathways Content": "<p>Workers entering this field typically begin their employment in entry-level positions. These positions may involve work in public relations, marketing publicity, website editing or writing in the public sector or non-governmental organizations.<\/p><p>With experience, workers may progress to supervisory and management positions, such as editor-in-chief or managing editor at large newspapers, magazines or publishing houses.<\/p>",
    "Related Careers Content": "<ul><li><a href=\"https:\/\/www.workbc.ca\/Jobs-Careers\/Explore-Careers\/Browse-Career-Profile\/0512\" >Managers - publishing, motion pictures, broadcasting and performing arts (NOC 0512)<\/a><\/li><li><a href=\"https:\/\/www.workbc.ca\/Jobs-Careers\/Explore-Careers\/Browse-Career-Profile\/1452\" >Correspondence, publication and regulatory clerks (NOC 1452)<\/a><\/li><li><a href=\"https:\/\/www.workbc.ca\/Jobs-Careers\/Explore-Careers\/Browse-Career-Profile\/2255\" >Technical occupations in geomatics and meteorology (NOC 2255)<\/a><\/li><li><a href=\"https:\/\/www.workbc.ca\/Jobs-Careers\/Explore-Careers\/Browse-Career-Profile\/5121\" >Authors and writers (NOC 5121)<\/a><\/li><li><a href=\"https:\/\/www.workbc.ca\/Jobs-Careers\/Explore-Careers\/Browse-Career-Profile\/5123\" >Journalists (NOC 5123)<\/a><\/li><li><a href=\"https:\/\/www.workbc.ca\/Jobs-Careers\/Explore-Careers\/Browse-Career-Profile\/5125\" >Translators, terminologists and interpreters (NOC 5125)<\/a><\/li><li><a href=\"https:\/\/www.workbc.ca\/Jobs-Careers\/Explore-Careers\/Browse-Career-Profile\/5131\" >Producers, directors, choreographers and related occupations (NOC 5131)<\/a><\/li><li><a href=\"https:\/\/www.workbc.ca\/Jobs-Careers\/Explore-Careers\/Browse-Career-Profile\/5225\" >Audio and video recording technicians (NOC 5225)<\/a><\/li><\/ul><p><\/p>",
    "Related Careers NOCs": "NOC 0512\nNOC 1452\nNOC 2255\nNOC 5121\nNOC 5123\nNOC 5125\nNOC 5131\nNOC 5225",
    "Occupational Interests Content": "<p>It’s important to understand what kinds of occupations align with your interests.<\/p><p>Here are the top occupational interests for this career profile:<\/p>",
    "Job Titles List": "Blog editor\nConsultant, editorial\nEditor\nEditor, art\nEditor, broadcasting\nEditor, language - English, French, etc.\nEditor, news - assignment \/ copy\nWeb site editor\nWriter-editor",
    "Career Video URLs": "https:\/\/youtu.be\/UsLsx3o55Wk",
    "Career Videos Content": "<p>Watch the video below to learn what a typical day is like for a managing editor.<\/p>",
    "Career Video Link": [
        ""
    ],
    "Education, Training and Skills Content": "<p>A bachelor's degree in English, French, journalism or a related discipline is often the minimum education requirement. Other requirements may include:<\/p><ul><li>Membership in the Editors' Association of Canada<\/li><li>Several years of experience in journalism, writing, publishing or a related field<\/li><li>A Master's or PhD in English Literature or World Literature<\/li><li>Experience with desktop publishing for some jobs<\/li><\/ul><p>In addition, workers in this field can improve their chances of getting a job with certification through the Editors' Association of Canada. After passing a series of exams, editors can earn the right to designate themselves a Certified Professional Editor (CPE).<\/p><p>Training in computer programs such as Photoshop, Adobe InDesign or Quark may also be helpful since it allows editors to work with design issues and use contemporary printing and website applications.<\/p>",
    "Education Programs in B.C. Content": "<p>The following program areas are related to this occupation:<\/p><ul><li>Broadcasting Related<\/li><li>English\/Literature Related<\/li><li>Journalism<\/li><li>Linguistics (Science)<\/li><li>Linguistics Related (Arts)<\/li><li>Publishing<\/li><li>Writing (Creative, Editing, Technical)<\/li><\/ul><p><\/p>",
    "Skills Content": "<p>Every job calls for a certain set of skills. Knowing those skills is the first step in finding a good career fit.<\/p><p>Here, you will find the 10 most relevant workplace skills. Some are more important to achieving success in a certain career than others. These skills may come naturally to you or you may need to gain them through education, training and experience.<\/p><p>See the list of work-related skills below, ranked in order of importance for this career. Check out the list and see if this career matches your skills—take that first step!<\/p>",
    "Labour Market Statistics Content": "<p>Discover data, facts and information that have been gathered and analyzed. Learn about the characteristics of the economy and labour market in B.C.<\/p>",
    "Employment Content ": "<p>Find out about employment types and trends by region and industry.<\/p>",
    "Labour Market Outlook Content": "<p>The B.C. Labour Market Outlook is a 10-year forecast of the expected supply and demand for labour in the province. It’s updated every year. The purpose is to provide British Columbians with the knowledge to make informed decisions on careers, skills training, education and hiring.<\/p>",
    "Industry Highlights Content": "<p>Learn about the opportunities in B.C.'s major industries, including employment trends, earning potential, locations of work and more.<\/p>",
    "Insights from Industry Content": "<p>Job opportunities in the next few years are expected to come from new job creation and the need to replace retiring workers.<\/p><p>Industry sources report that there is currently a large supply of recent graduates seeking work in addition to an already good supply of experienced editors. As demand for editors is expected to be average, future jobs for new graduates will be limited due to tough competition from more experienced editors.<\/p><p>Many editors work in the traditional areas of newspaper and printed publications, which have seen little expansion. Advances in technology have affected this field of work, and the internet is having a noticeable impact on traditional media. As a result, editors need to be fluent in both traditional and new media in order to perform effectively. As well, there will be greater opportunities for editors with specialized training (e.g., legal editing, editing of technology websites, editing jobs requiring medical or science background).<\/p><p>In recent years, the Canadian book industry has experienced economic challenges. As a result, many book editors have turned to freelance or contract-based work as opposed to full-time employment at one firm.<\/p><p>Education and certification will likely become more important, and applicants looking for work in book editing will benefit from taking a university publishing program or earning a Master's degree in publishing. Membership in the Editors' Association of Canada will likely become more important to employers in the coming years.<\/p>",
    "Resources": [
        {
            "Resource Title": "",
            "Resource Link": ""
        }
    ]
},
{
    "Page Title": "Education policy researchers, consultants and program officers",
    "Banner Image": [],
    "NOC": "(NOC 4166)",
    "Career Overview Content": "<p>Education policy researchers, consultants and program officers conduct research, produce reports and administer elementary, secondary and post-secondary education policies and programs.<\/p><p><strong>People in this occupation:<\/strong><\/p><ul><li>Evaluate curriculum and services, recommend improvements, determine the cost and effectiveness of educational policies and programs, produce reports and deliver presentations<\/li><li>Often work for government, school boards, post-secondary institutions and research institutes, professional associations and educational and other organizations throughout the public and private sectors<\/li><li>May be self-employed<\/li><li>Should have an interest in doing research and creating materials and other resources for program delivery and coordinating information for statistical analyses<\/li><li>Should have quantitative and qualitative research skills<\/li><\/ul><p><\/p>",
    "Duties Content": "<p><strong>Education policy researchers, consultants and program officers perform some or all of the following duties:<\/strong><\/p><ul><li>Do quantitative and qualitative research, produce reports and manage education or post-secondary education policies and programs<\/li><li>Evaluate program curriculum and recommend improvements<\/li><li>Develop the structure, content and objectives of new programs<\/li><li>Do statistical analyses to determine the cost and effectiveness of education or post-secondary education policies and programs<\/li><li>Provide ongoing professional development, training and consultative services to teachers and other professionals throughout the public and private sector<\/li><li>Deliver presentations at conferences, workshops and symposia<\/li><li>May supervise the work of other education policy researchers, consultants or program officers<\/li><li>May administer specialized testing and assessment programs<\/li><li>Develop teaching materials and other resources for program delivery<\/li><\/ul><p><\/p>",
    "Additional Duties List": "",
    "Salary Content": "<p>Earnings is income that workers receive in exchange for their labour. Depending on the type of employment, earnings can be in the form of wages (hourly), salaries (fixed monthly or annual) or self-employed earnings.<\/p>",
    "Work Environment Content": "<p>Education policy researchers, consultants and program officers usually work in an office setting with regular working hours And possibly some overtime.<\/p><p>These professionals may work individually or as part of a research team. Travel may be required to gather information or to attend meetings, workshops or conferences.<\/p><p>Education policy researchers, consultants and program officers use computers, so they need to be aware of the stresses placed on the neck, back and shoulders while at their workstations.<\/p>",
    "Career Pathways Content": "<p>Recent graduates can typically find part-time or on-call work as substitute teachers. Short-term work may include filling in openings caused by maternity leave or sabbaticals.<\/p><p>Teachers with experience may progress to other positions, such as education consultant, vice-principal, principal or school district senior management.<\/p>",
    "Related Careers Content": "<ul><li><a href=\"https:\/\/www.workbc.ca\/Jobs-Careers\/Explore-Careers\/Browse-Career-Profile\/0413\" >Government managers - education policy development and program administration (NOC 0413)<\/a><\/li><li><a href=\"https:\/\/www.workbc.ca\/Jobs-Careers\/Explore-Careers\/Browse-Career-Profile\/4021\" >College and other vocational instructors (NOC 4021)<\/a><\/li><li><a href=\"https:\/\/www.workbc.ca\/Jobs-Careers\/Explore-Careers\/Browse-Career-Profile\/4031\" >Secondary school teachers (NOC 4031)<\/a><\/li><li><a href=\"https:\/\/www.workbc.ca\/Jobs-Careers\/Explore-Careers\/Browse-Career-Profile\/4032\" >Elementary school and kindergarten teachers (NOC 4032)<\/a><\/li><li><a href=\"https:\/\/www.workbc.ca\/Jobs-Careers\/Explore-Careers\/Browse-Career-Profile\/4033\" >Educational counsellors (NOC 4033)<\/a><\/li><li><a href=\"https:\/\/www.workbc.ca\/Jobs-Careers\/Explore-Careers\/Browse-Career-Profile\/4164\" >Social policy researchers, consultants and program officers (NOC 4164)<\/a><\/li><\/ul><p><\/p>",
    "Related Careers NOCs": "NOC 0413\nNOC 4021\nNOC 4031\nNOC 4032\nNOC 4033\nNOC 4164",
    "Occupational Interests Content": "<p>It’s important to understand what kinds of occupations align with your interests.<\/p><p>Here are the top occupational interests for this career profile:<\/p>",
    "Job Titles List": "Adviser \/ analyst, education policy\nAnalyst, education policy\nAssessor, language\nConsultant, curriculum \/ teaching\nConsultant, distance education\nCo-ordinator, education outreach program\nCurriculum developer \/ planner\nEducation policy \/ research\nEducation program co-ordinator \/ officer\nEducation researcher\nInspector, board of education\nLiteracy coach\nPolicy analyst \/ officer, education\nProgram officer, adult education\nProgram, education - developer \/ planner\nSpecial education co-ordinator\nSpecialist, education science\nSpecialist, educational & vocational\nSpecialist, program development",
    "Career Video URLs": "",
    "Career Videos Content": "",
    "Career Video Link": [
        ""
    ],
    "Education, Training and Skills Content": "<p>Education policy researchers, consultants and program officers must have a bachelor's degree in education or in a discipline such as social science or business administration. Other requirements may include:<\/p><ul><li>A master's degree in education or social science, or specialized training or certification<\/li><li>For jobs in provincial education ministries, several years of experience as a school teacher and a teacher's certificate<\/li><\/ul><p><\/p>",
    "Education Programs in B.C. Content": "<p>The following program areas are related to this occupation:<\/p><ul><li>Adult Education<\/li><li>Psychology (Arts)<\/li><li>Psychology (Science)<\/li><\/ul><p><\/p>",
    "Skills Content": "<p>Every job calls for a certain set of skills. Knowing those skills is the first step in finding a good career fit.<\/p><p>Here, you will find the 10 most relevant workplace skills. Some are more important to achieving success in a certain career than others. These skills may come naturally to you or you may need to gain them through education, training and experience.<\/p><p>See the list of work-related skills below, ranked in order of importance for this career. Check out the list and see if this career matches your skills—take that first step!<\/p>",
    "Labour Market Statistics Content": "<p>Discover data, facts and information that have been gathered and analyzed. Learn about the characteristics of the economy and labour market in B.C.<\/p>",
    "Employment Content ": "<p>Find out about employment types and trends by region and industry.<\/p>",
    "Labour Market Outlook Content": "<p>The B.C. Labour Market Outlook is a 10-year forecast of the expected supply and demand for labour in the province. It’s updated every year. The purpose is to provide British Columbians with the knowledge to make informed decisions on careers, skills training, education and hiring.<\/p>",
    "Industry Highlights Content": "<p>Learn about the opportunities in B.C.'s major industries, including employment trends, earning potential, locations of work and more.<\/p>",
    "Insights from Industry Content": "<p>Job openings in the coming years will result from new job creation and the need to replace retiring workers.<\/p><p>Most job openings will likely be found in consulting firms, professional associations, research institutes, educational institutions and non-government organizations. Industry sources expect more work opportunities to be either part time or contractual, with self-employment becoming more common.<\/p><p>There may be regional differences in demand for workers in this occupation because of difficulties with recruitment and retention in rural areas. Industry sources also report that employers have difficulty filling some senior-level positions because of a shortage of experienced workers.<\/p><p>Job prospects are best for those with advanced degrees.<\/p>",
    "Resources": [
        {
            "Resource Title": "",
            "Resource Link": ""
        }
    ]
},
{
    "Page Title": "Electrical and electronics engineers",
    "Banner Image": [],
    "NOC": "(NOC 2133)",
    "Career Overview Content": "<p>Electrical and electronics engineers design, plan, research, review and test electrical and electronic equipment and systems.<\/p><p>Electrical and electronics engineers can work in the public and private sector. People in this career are employed by companies in many different sectors including manufacturing, processing, transportation, electrical utilities and communications. They may work for manufacturers of electrical and electronic equipment, consulting firms and government.<\/p>",
    "Duties Content": "<p>In general, electrical and electronics engineers:<\/p><ul><li>Research the feasibility, design, operation and performance of power systems, electrical machinery and electronic communications, instrumentation and control systems, including the individual equipment and components used<\/li><li>Prepare project budgets, timing estimates and reports<\/li><li>Design specifications for electrical and electronic systems and equipment<\/li><li>Design electrical and electronic circuits, components, systems and equipment, such as systems that transmit voice, video and data over copper wires, fibre optics or microwave networks<\/li><li>Supervise and inspect the installation, modification, testing and operation of electrical and electronic systems and equipment<\/li><li>Develop maintenance and operating standards for electrical and electronic systems and equipment<\/li><li>Investigate electrical or electronic failures<\/li><li>Prepare contracts and review tenders for construction or maintenance<\/li><\/ul><p>People in this job may also supervise technicians, technologists, programmers, analysts and other engineers on a project or in a department or company.<\/p><p>In addition, electrical and electronics engineers may specialize in a number of areas including electrical design for residential, commercial or industrial installations, electrical power generation and transmission, and instrumentation and control systems.<\/p><p>People in this career may also be involved in the development of electronics and nanoelectronics, such as solar cells, thin film display, quantum computers, high-speed communications systems, optics and optoelectronics, and medical electronics.<\/p>",
    "Additional Duties List": "",
    "Salary Content": "<p>Earnings is income that workers receive in exchange for their labour. Depending on the type of employment, earnings can be in the form of wages (hourly), salaries (fixed monthly or annual) or self-employed earnings.<\/p>",
    "Work Environment Content": "<p>Electrical and electronics engineers usually work a standard 40-hour week; however, project deadlines may require them to work longer hours and in some cases at night or on the weekend.<\/p><p>People in this job can work in a variety of settings due to improvements in technology, including a company office or a home office. Some electrical and electronics engineers inspect, oversee and solve on-site problems in laboratories or industrial plants while others do outdoor field work as a part of operational, maintenance or construction activities.<\/p><p>Job hazards vary depending on the situation; however, during field activities there may be a risk of electrical shock from field wiring if safety procedures are not followed.<\/p>",
    "Career Pathways Content": "<p>Generally, recent graduates begin as a junior engineer or engineer-in-training. With experience, people in this job can advance to positions such as senior engineers, project managers, principal engineers or partners. Individuals in this career may earn master's degree to work in a more specialized field.<\/p><p>There are many different areas of specialization in this field. Some electrical and electronics engineers:<\/p><ul><li>Perform electrical design for residential, commercial or industrial installations, electrical power and communications systems, and instrumentation and control systems<\/li><li>Apply engineering science to make products for homes, such as consumer electronics, to make electrical\/electronic products for industry and commercial applications (consumer)<\/li><li>Work on image processing or control systems for the industrial and commercial applications<\/li><li>Design and build a variety of other items (for example, medical equipment, space technology, environmental monitoring systems, and technology used in underwater research)<\/li><\/ul><p>Electrical and electronic engineers who go on to earn a doctoral degree can contribute to the field through research and teaching at the post-secondary level or they may find work in a larger firm in their specialty.<\/p>",
    "Related Careers Content": "<ul><li><a href=\"https:\/\/www.workbc.ca\/Jobs-Careers\/Explore-Careers\/Browse-Career-Profile\/0211\" >Engineering managers (NOC 0211)<\/a><\/li><li><a href=\"https:\/\/www.workbc.ca\/Jobs-Careers\/Explore-Careers\/Browse-Career-Profile\/0213\" >Computer and information systems managers (NOC 0213)<\/a><\/li><li><a href=\"https:\/\/www.workbc.ca\/Jobs-Careers\/Explore-Careers\/Browse-Career-Profile\/2147\" >Computer engineers (except software engineers and designers) (NOC 2147)<\/a><\/li><li><a href=\"https:\/\/www.workbc.ca\/Jobs-Careers\/Explore-Careers\/Browse-Career-Profile\/2173\" >Software engineers and designers (NOC 2173)<\/a><\/li><li><a href=\"https:\/\/www.workbc.ca\/Jobs-Careers\/Explore-Careers\/Browse-Career-Profile\/2241\" >Electrical and electronics engineering technologists and technicians (NOC 2241)<\/a><\/li><\/ul><p><\/p>",
    "Related Careers NOCs": "NOC 0211\nNOC 0213\nNOC 2147\nNOC 2173\nNOC 2241",
    "Occupational Interests Content": "<p>It’s important to understand what kinds of occupations align with your interests.<\/p><p>Here are the top occupational interests for this career profile:<\/p>",
    "Job Titles List": "Engineer, antenna \/ satellite\nEngineer, audio\nEngineer, broadcasting professional\nEngineer, circuit design\nEngineer, controls \/ instrumentation\nEngineer, design - electrical power\nEngineer, design - electronic systems\nEngineer, design - radio & TV broadcasting\nEngineer, distribution planning\nEngineer, electrical\nEngineer, electrical distribution\nEngineer, electrical power systems\nEngineer, line construction\nEngineer, low-voltage equipment\nEngineer, meter \/ metrology\nEngineer, overhead electrical distribution\nEngineer, protective relay\nEngineer, radar\nEngineer, research - nanoelectronics\nEngineer, roadway lighting design\nEngineer, signal\nEngineer, spacecraft electronics\nEngineer, test - electronics",
    "Career Video URLs": "https:\/\/youtu.be\/V3gjgqxN238",
    "Career Videos Content": "<p>Watch the video below to learn what a typical day is like for an electrical engineer.<\/p>",
    "Career Video Link": [
        ""
    ],
    "Education, Training and Skills Content": "<p>Electrical and electronics engineers must complete a bachelor's degree in electrical or electronics engineering or in an appropriate related engineering discipline. They must also be registered with Engineers and Geoscientists of British Columbia.<\/p><p>For those working to earn their university degree for this career, it is helpful to participate in an undergraduate co-op\/internship program or find a summer job that is related to the work of an electrical and electronics engineer.<\/p><p>Once education requirements are met, an electrical or electronic engineering graduate can apply for an Engineer-In-Training membership as they gain the four years of engineering experience needed to register as a Professional Engineer.<\/p><p>Continuing professional development (for example, participation in professional committees, self-directed studies, additional coursework and workshops) is encouraged and may soon be required for continued membership in Engineers and Geoscientists of British Columbia, which offers these types of educational opportunities.<\/p><p>A master's or doctoral degree in a related engineering discipline may be required for some positions.<\/p>",
    "Education Programs in B.C. Content": "<p>The following program areas are related to this occupation:<\/p><ul><li>Electrical, Electronic &amp; Communications Engineering<\/li><li>Engineering Science<\/li><\/ul><p><\/p>",
    "Skills Content": "<p>Every job calls for a certain set of skills. Knowing those skills is the first step in finding a good career fit.<\/p><p>Here, you will find the 10 most relevant workplace skills. Some are more important to achieving success in a certain career than others. These skills may come naturally to you or you may need to gain them through education, training and experience.<\/p><p>See the list of work-related skills below, ranked in order of importance for this career. Check out the list and see if this career matches your skills—take that first step!<\/p>",
    "Labour Market Statistics Content": "<p>Discover data, facts and information that have been gathered and analyzed. Learn about the characteristics of the economy and labour market in B.C.<\/p>",
    "Employment Content ": "<p>Find out about employment types and trends by region and industry.<\/p>",
    "Labour Market Outlook Content": "<p>The B.C. Labour Market Outlook is a 10-year forecast of the expected supply and demand for labour in the province. It’s updated every year. The purpose is to provide British Columbians with the knowledge to make informed decisions on careers, skills training, education and hiring.<\/p>",
    "Industry Highlights Content": "<p>Learn about the opportunities in B.C.'s major industries, including employment trends, earning potential, locations of work and more.<\/p>",
    "Insights from Industry Content": "<p>Electric, gas, telephone and other utility companies are typical employers in the province of British Columbia that may have an increased need for electrical and electronics engineers in the future. More and more, companies are using consulting and service companies for their engineering needs which means that most employment growth will be in these non-manufacturing firms.<\/p><p>Since most companies looking to hire an engineering firm consider the reputation of the whole firm and not just the people who work there, self-employment may not be a good option for those in this career.<\/p><p>The aerospace, oil and high voltage power system industries may offer opportunities for larger electronic and electrical engineering companies to work on international contracts. People in this career who would like to work in international consulting must have a good reputation, be able to adapt to different cultures, and work with a multicultural team.<\/p><p>Continued changes in technology mean that people in this job must stay up to date in this area.<\/p><p>Alternative and renewable energy resource sectors may create a change for those in this career. New technologies such as wind, geothermal, solar, tidal, biomass and other non-traditional resources are being used more and more and will likely change how electrical and electronics engineers to do their jobs in the coming years. This could also result in an increase in jobs that are located outside of larger cities.<\/p>",
    "Resources": [
        {
            "Resource Title": "",
            "Resource Link": ""
        }
    ]
},
{
    "Page Title": "Electrical mechanics",
    "Banner Image": [],
    "NOC": "(NOC 7333)",
    "Career Overview Content": "<p><strong>People in this occupation:<\/strong><\/p><ul><li>Maintain, test, rebuild and repair electric motors, transformers, switchgear and other electrical apparatus<\/li><li>Work for independent electrical repair shops, service shops of electrical equipment manufacturers and maintenance departments of manufacturing companies<\/li><\/ul><p><\/p>",
    "Duties Content": "<p><strong>Electrical mechanics:<\/strong><\/p><ul><li>Test and observe electrical, electronic and mechanical components and systems using testing and measuring instruments<\/li><li>Troubleshoot and repair electric motors, transformers, switchgear, generators and other electro-mechanical equipment<\/li><li>Replace or recondition shafts, bearings, commutators and other components<\/li><li>Wind, assemble and install various types of coils for electric motors or transformer<\/li><li>Do static or dynamic balancing of armatures or rotors by welding, brazing or soldering electrical connections and by aligning and adjusting parts<\/li><li>Test and repair or replace faulty wiring or components in electrical switchgear<\/li><li>Test repaired motors, transformers, switchgear or other electrical apparatus to make sure they run properly<\/li><li>Do some machining to recondition or modify shafts, commutators or other parts<\/li><li>Do on-site servicing and repair<\/li><\/ul><h2>Special duties<\/h2><p>Electrical mechanics may specialize in working with certain types of apparatus, such as electric motors or transformers, or in certain functions, such as winding coils.<\/p>",
    "Additional Duties List": "",
    "Salary Content": "<p>Earnings is income that workers receive in exchange for their labour. Depending on the type of employment, earnings can be in the form of wages (hourly), salaries (fixed monthly or annual) or self-employed earnings.<\/p>",
    "Work Environment Content": "<p><strong>Key aspects of the work in this occupation:<\/strong><\/p><ul><li>Work takes place in a controlled indoor environment.<\/li><li>Working with equipment, machinery or power\/hand tools may be a source of injury.<\/li><li>Exposure to electrical circuitry, high tension wires, transformers or other equipment may be a source of electrical shock<\/li><li>Exposure to fire, to emissions of steam or to intensely hot surfaces may also cause injury.<\/li><li>The workplace may be noisy enough to cause marked distraction or possible loss of hearing.<\/li><\/ul><p><\/p>",
    "Career Pathways Content": "<p>Progression to supervisory positions is possible with experience.<\/p><p>Red Seal trade certification allows for movement between provinces.<\/p><p>Although specialization may occur, workers in this group are expected to be capable of repairing all electrical apparatus.<\/p>",
    "Related Careers Content": "<ul><li><a href=\"https:\/\/www.workbc.ca\/Jobs-Careers\/Explore-Careers\/Browse-Career-Profile\/2244\" >Aircraft instrument, electrical and avionics mechanics, technicians and inspectors (NOC 2244)<\/a><\/li><li><a href=\"https:\/\/www.workbc.ca\/Jobs-Careers\/Explore-Careers\/Browse-Career-Profile\/7301\" >Contractors and supervisors, mechanic trades (NOC 7301)<\/a><\/li><li><a href=\"https:\/\/www.workbc.ca\/Jobs-Careers\/Explore-Careers\/Browse-Career-Profile\/7242\" >Industrial electricians (NOC 7242)<\/a><\/li><li><a href=\"https:\/\/www.workbc.ca\/Jobs-Careers\/Explore-Careers\/Browse-Career-Profile\/9525\" >Assemblers, fabricators and inspectors, industrial electrical motors and transformers (NOC 9525)<\/a><\/li><\/ul><p><\/p>",
    "Related Careers NOCs": "NOC 2244\nNOC 7301\nNOC 7242\nNOC 9525",
    "Occupational Interests Content": "<p>It’s important to understand what kinds of occupations align with your interests.<\/p><p>Here are the top occupational interests for this career profile:<\/p>",
    "Job Titles List": "Mechanic, electrical instrument\nMechanic, electrical rewind\nMechanic, meter repair \/ switchgear\nMechanic-repairer, electric motor\nRepairer, armature winder\nRepairer, automotive-generator and starter\nRepairer, coil connector \/ coil winder\nRepairer, generator \/ storage battery\nRepairer, high-voltage power transformer\nRepairer-technician, electric meter\nTechnician, electric motor systems\nWinder-electrician\nWinder-repairer, electric motor\nWinder-repairer, industrial coil",
    "Career Video URLs": "",
    "Career Videos Content": "",
    "Career Video Link": [
        ""
    ],
    "Education, Training and Skills Content": "<ul><li>Completion of secondary school is usually required.<\/li><li>Completion of a four-year apprenticeship program or A combination of over four years of work experience in the trade and some college or industry courses in electrical mechanics is usually required for trade certification.<\/li><li>Trade certification as an electric motor system technician is available, but voluntary, in Newfoundland and Labrador, Nova Scotia, Prince Edward Island, New Brunswick, Ontario, Manitoba, Alberta, British Columbia, the Yukon and Nunavut.<\/li><li>Electrical motor and equipment repairer – winding trade certification is available, but voluntary in Quebec.<\/li><li>Electrical motor system technician (electrical utility) trade certification is available, but voluntary in New Brunswick.<\/li><li>Red Seal endorsement is also available to qualified electric motor system technicians upon successful completion of the interprovincial Red Seal examination<\/li><\/ul><h3><strong>Trades training resources<\/strong><\/h3><p>Visit our trades training page at <a href=\"https:\/\/www.workbc.ca\/trades\" >www.workbc.ca\/trades<\/a> to learn about apprenticeship and trades training in B.C.<\/p>",
    "Education Programs in B.C. Content": "",
    "Skills Content": "<p>Every job calls for a certain set of skills. Knowing those skills is the first step in finding a good career fit.<\/p><p>Here, you will find the 10 most relevant workplace skills. Some are more important to achieving success in a certain career than others. These skills may come naturally to you or you may need to gain them through education, training and experience.<\/p><p>See the list of work-related skills below, ranked in order of importance for this career. Check out the list and see if this career matches your skills—take that first step!<\/p>",
    "Labour Market Statistics Content": "<p>Discover data, facts and information that have been gathered and analyzed. Learn about the characteristics of the economy and labour market in B.C.<\/p>",
    "Employment Content ": "<p>Find out about employment types and trends by region and industry.<\/p>",
    "Labour Market Outlook Content": "<p>The B.C. Labour Market Outlook is a 10-year forecast of the expected supply and demand for labour in the province. It’s updated every year. The purpose is to provide British Columbians with the knowledge to make informed decisions on careers, skills training, education and hiring.<\/p>",
    "Industry Highlights Content": "<p>Learn about the opportunities in B.C.'s major industries, including employment trends, earning potential, locations of work and more.<\/p>",
    "Insights from Industry Content": "",
    "Resources": [
        {
            "Resource Title": "",
            "Resource Link": ""
        }
    ]
},
{
    "Page Title": "Electronic service technicians (household and business equipment)",
    "Banner Image": [],
    "NOC": "(NOC 2242)",
    "Career Overview Content": "<p>Electronic service technicians service and repair household and business electronic equipment such as audio and video systems, computers and peripherals, office equipment and other consumer electronic equipment and assemblies.<\/p><p><strong>People in this occupation:<\/strong><\/p><ul><li>Work for electronic service and retail companies, wholesale distributors and service departments of electronic manufacturing companies<\/li><\/ul><p><\/p>",
    "Duties Content": "<p><strong>Electronic service technicians perform some or all of the following duties:<\/strong><\/p><ul><li>Install, maintain and repair household and business electronic equipment such as televisions, radios, video cassette recorders, stereo equipment, photocopiers, computers and peripherals<\/li><li>Inspect and test electronic equipment, components and assemblies using multimeters, circuit testers, oscilloscopes, logic probes and other electronic test instruments, tools and equipment<\/li><li>Diagnose and locate circuit, component and equipment faults<\/li><li>Adjust, align, replace or repair electronic equipment, assemblies and components following equipment manuals and schematics, and using soldering tools and other hand and power tools<\/li><li>Complete work orders, test and maintenance reports<\/li><li>Supervise other electronic equipment service technicians<\/li><\/ul><p><\/p>",
    "Additional Duties List": "",
    "Salary Content": "<p>Earnings is income that workers receive in exchange for their labour. Depending on the type of employment, earnings can be in the form of wages (hourly), salaries (fixed monthly or annual) or self-employed earnings.<\/p>",
    "Work Environment Content": "<p><strong>Key aspects of the work in this occupation:<\/strong><\/p><ul><li>Work takes place in a conventional environment such as an office, hospital or school.<\/li><li>Work is done near or with equipment, instruments, machinery, power tools or hand tools that may be a source of accident or injury.<\/li><li>Workers may be exposed to electrical circuitry, high tension wires, transformers or other equipment that may be a source of electrical shock.<\/li><\/ul><p><strong>Examples of activities during which workers may be at risk:<\/strong><\/p><ul><li>Installing or repairing electrical wiring, motors and generators<\/li><li>Maintaining underground power transmission and distribution systems<\/li><li>Operating semi-automatic electric arc welding equipment<\/li><li>Repairing industrial electrical control systems and devices<\/li><\/ul><p><\/p>",
    "Career Pathways Content": "<p>Red Seal trade certification allows for mobility between provinces. Advancement to supervisory positions is possible with experience.<\/p>",
    "Related Careers Content": "<ul><li><a href=\"https:\/\/www.workbc.ca\/Jobs-Careers\/Explore-Careers\/Browse-Career-Profile\/2241\" >Electrical and electronics engineering technologists and technicians (NOC 2241)<\/a><\/li><li><a href=\"https:\/\/www.workbc.ca\/Jobs-Careers\/Explore-Careers\/Browse-Career-Profile\/7246\" >Telecommunications installation and repair workers (NOC 7246)<\/a><\/li><\/ul><p><\/p>",
    "Related Careers NOCs": "NOC 2241\nNOC 7246",
    "Occupational Interests Content": "<p>It’s important to understand what kinds of occupations align with your interests.<\/p><p>Here are the top occupational interests for this career profile:<\/p>",
    "Job Titles List": "Installer \/ repairer, audiovisual (AV)\nInstaller \/ repairer, electronic equipment\nInstaller \/ repairer, fire \/ security alarms\nInstaller \/ repairer, office machines\nInstaller \/ repairer, photoelectric sorter\nInstaller \/ repairer, public address (PA)\nInstaller \/ repairer, radio communication\nInstaller \/ repairer, TV studio equipment\nInstaller \/ servicer, satellite antenna\nInstaller \/ servicer, video equipment\nInstaller, alarm systems\nInstaller, closed circuit television\nRepairer, amplifier \/ synthesizer\nRepairer, video camera\nServicer, ATM (automatic teller machine)\nServicer, electronic cash register\nSlot machine technician - casino\nSupervisor, installation \/ repair\nSupervisor, radio \/ TV repair\nSupervisor, service technicians\nTechnician, computer equipment\nTechnician, repair - audio-video-stereo\nTechnician, service - radio \/ TV\nTechnician, totalizator systems",
    "Career Video URLs": "",
    "Career Videos Content": "",
    "Career Video Link": [
        ""
    ],
    "Education, Training and Skills Content": "<ul><li>Completion of a two- to three-year college program in electronics<br\/>or<br\/>Completion of a four-year apprenticeship program in electronic servicing and repair<br\/>or<br\/>Completion of high school or college courses in electronics and on-the-job training is required.<\/li><li>Trade certification for electronics technicians (consumer products) is available, but voluntary, in Ontario, British Columbia and the Yukon.<\/li><\/ul><p>For additional information, see the Industry Training Authority at <a href=\"http:\/\/www.itabc.ca\/\"  target=\"_blank\" rel=\"noopener noreferrer\">http:\/\/www.itabc.ca<\/a>.<br\/><br\/>Those who are certified for an occupation by a regulator elsewhere in Canada can apply for the same certification from the regulator in B.C. Under the terms of the <a href=\"https:\/\/www.cfta-alec.ca\/\"  target=\"_blank\" rel=\"noopener noreferrer\">Canadian Free Trade Agreement (CFTA)<\/a>, most applicants who are transferring their credentials from elsewhere in Canada will not be required to complete additional training or testing. However, the B.C. regulator may ask applicants to provide further information such as a letter of good standing, references, or criminal record check.<br\/><br\/>For those who trained outside of Canada and never received certification from any Canadian jurisdiction, a full assessment is likely needed. Most occupational regulators have a process for assessment and recognize internationally trained applicants.<br\/><br\/>Contact the <a href=\"https:\/\/asttbc.org\/\"  target=\"_blank\" rel=\"noopener noreferrer\">Applied Science Technologists and Technicians of BC<\/a> and\/or the <a href=\"https:\/\/www2.gov.bc.ca\/gov\/content\/employment-business\/business\/security-services\"  target=\"_blank\" rel=\"noopener noreferrer\">Ministry of Public Safety and Solicitor General: Security Services<\/a> for details on how to apply for certification in B.C.<br\/><br\/>For information about labour mobility in Canada, visit <a href=\"http:\/\/www.workersmobility.ca\/\"  target=\"_blank\" rel=\"noopener noreferrer\">www.workersmobility.ca<\/a>.<br\/><br\/>View a list of <a href=\"https:\/\/www.workbc.ca\/Jobs-Careers\/Explore-Careers\/B-C-Occupational-Regulators.aspx\" >B.C. occupational regulators<\/a>.<\/p><p><\/p><h3><strong>Trades training resources<\/strong><\/h3><p>Visit our trades training page at <a href=\"https:\/\/www.workbc.ca\/trades\" >www.workbc.ca\/trades<\/a> to learn about apprenticeship and trades training in B.C.<\/p>",
    "Education Programs in B.C. Content": "<p>The following program areas are related to this occupation:<\/p><ul><li>Security Alarm Installer<\/li><\/ul><p><\/p>",
    "Skills Content": "<p>Every job calls for a certain set of skills. Knowing those skills is the first step in finding a good career fit.<\/p><p>Here, you will find the 10 most relevant workplace skills. Some are more important to achieving success in a certain career than others. These skills may come naturally to you or you may need to gain them through education, training and experience.<\/p><p>See the list of work-related skills below, ranked in order of importance for this career. Check out the list and see if this career matches your skills—take that first step!<\/p>",
    "Labour Market Statistics Content": "<p>Discover data, facts and information that have been gathered and analyzed. Learn about the characteristics of the economy and labour market in B.C.<\/p>",
    "Employment Content ": "<p>Find out about employment types and trends by region and industry.<\/p>",
    "Labour Market Outlook Content": "<p>The B.C. Labour Market Outlook is a 10-year forecast of the expected supply and demand for labour in the province. It’s updated every year. The purpose is to provide British Columbians with the knowledge to make informed decisions on careers, skills training, education and hiring.<\/p>",
    "Industry Highlights Content": "<p>Learn about the opportunities in B.C.'s major industries, including employment trends, earning potential, locations of work and more.<\/p>",
    "Insights from Industry Content": "",
    "Resources": [
        {
            "Resource Title": "",
            "Resource Link": ""
        }
    ]
},
{
    "Page Title": "Electronics assemblers, fabricators, inspectors and testers",
    "Banner Image": [],
    "NOC": "(NOC 9523)",
    "Career Overview Content": "<p>Electronic assemblers and inspectors in this unit group work for electronics manufacturing plants and perform a variety of tasks.<\/p><p><strong>People in this occupation:<\/strong><\/p><ul><li>Assemble and construct electronic equipment, parts and components<\/li><li>Inspect and test electronic parts and components to ensure they meet certain standards<\/li><\/ul><p><\/p>",
    "Duties Content": "<p><strong>Electronic Assemblers in this unit group:<\/strong><\/p><ul><li>Assemble various electronic components on printed circuit boards<\/li><li>Assemble small circuits requiring fine hand assembly with the use of microscopes and following cleanroom procedures<\/li><li>Install, mount, fasten, align and adjust parts, components, wiring and harnesses to items using hand and small power tools<\/li><li>Operate automatic and semi-automatic machines to position, solder and clean components on printed circuit boards<\/li><li>Replace defective components and repair older devices<\/li><\/ul><p><strong>Electronic Fabricators in this unit group:<\/strong><\/p><ul><li>Operate and check equipment including automatic and semi-automatic machines to make electronic components<\/li><li>Solder, clean, seal and stamp components and perform other tasks as needed<\/li><li>Set up equipment and follow cleanroom procedures as required<\/li><\/ul><p><strong>Inspectors in this unit group:<\/strong><\/p><ul><li>Inspect electronic components for quality on products being assembled or fabricated<\/li><li>Check final assembly for finish, labeling and packaging<\/li><li>Check shape and size of items and perform electrical tests<\/li><li>Identify and mark acceptable and defective items and return faulty items to production for repair<\/li><li>Collect, record and review inspection results<\/li><li>Investigate equipment malfunction and instruct on proper operation<\/li><\/ul><p><strong>Electronic testers:<\/strong><\/p><ul><li>Operate various test equipment and tools to perform simple tests of electronic components, parts and systems<\/li><li>Set up and operate automatic testing equipment to locate circuit and wiring problems, shorts and component defects<\/li><li>Compare test results to specifications and set parts or products aside for repair<\/li><li>Replace components or parts as needed<\/li><li>May conduct life tests on items<\/li><li>Maintain test result reports<\/li><\/ul><p><\/p>",
    "Additional Duties List": "",
    "Salary Content": "<p>Earnings is income that workers receive in exchange for their labour. Depending on the type of employment, earnings can be in the form of wages (hourly), salaries (fixed monthly or annual) or self-employed earnings.<\/p>",
    "Work Environment Content": "<p><strong>Key aspects of work in this occupation:<\/strong><\/p><ul><li>Assemblers and inspectors in this unit group usually work in a conventional controlled environment such as an office, hospital or school.<\/li><li>Work may be performed with equipment, machinery or power\/hand tools that could cause an injury.<\/li><li>Workers are exposed to electrical circuitry, high-tension wires, transformers or other equipment that may be a source of electrical shock.<\/li><\/ul><p><strong>Examples:<\/strong><\/p><ul><li>Installing or repairing electrical wiring, motors and generators<\/li><li>Maintaining underground power transmission and distribution systems<\/li><li>Operating semi-automatic electric arc welding equipment<\/li><li>Repairing industrial electrical control systems and devices<\/li><\/ul><p><\/p>",
    "Career Pathways Content": "<p>Progression from electronics assembler or component fabricator to electronics inspector or tester is possible with additional training and experience.<\/p>",
    "Related Careers Content": "<ul><li><a href=\"https:\/\/www.workbc.ca\/Jobs-Careers\/Explore-Careers\/Browse-Career-Profile\/2241\" >Electrical and electronics engineering technologists and technicians (NOC 2241)<\/a><\/li><li><a href=\"https:\/\/www.workbc.ca\/Jobs-Careers\/Explore-Careers\/Browse-Career-Profile\/2242\" >Electronic service technicians (household and business equipment) (NOC 2242)<\/a><\/li><li><a href=\"https:\/\/www.workbc.ca\/Jobs-Careers\/Explore-Careers\/Browse-Career-Profile\/9222\" >Supervisors, electronics manufacturing (NOC 9222)<\/a><\/li><li><a href=\"https:\/\/www.workbc.ca\/Jobs-Careers\/Explore-Careers\/Browse-Career-Profile\/9524\" >Assemblers and inspectors, electrical appliance, apparatus and equipment manufacturing (NOC 9524)<\/a><\/li><\/ul><p><\/p>",
    "Related Careers NOCs": "NOC 2241\nNOC 2242\nNOC 9222\nNOC 9524",
    "Occupational Interests Content": "<p>It’s important to understand what kinds of occupations align with your interests.<\/p><p>Here are the top occupational interests for this career profile:<\/p>",
    "Job Titles List": "Adjuster, filament-winding machine\nAligner, electronic equipment manuf'g\nAssembler, bench \/ components\nAssembler, business-office machine\nAssembler, capacitor\nAssembler, circuit board \/ microcircuit\nAssembler, communications equipment\nAssembler, electronics\nAssembler, precision instruments\nAssembler, resistor \/ variable resistor\nAssembler, television \/ speaker\nAssembler-installer, chassis\nBench \/ conveyor line\nCleaner, electronic component\nCoater, funnel\nCrystal calibrator \/ final tester\nDie attacher\nEtcher and plater, quartz crystal\nFabricator, microelectronic circuit\nFormer, fluorescent screen\nGauger, grid \/ semiconductor material\nImpregnator and dryer\nInspector-tester, capacitor \/ coil \/ grid\nInspector-tester, electronics\nInspector-tester, hearing aid\nInspector-tester, mobile transceiver\nInstaller, electronic equipment manuf'g\nMaker, electronic instruments\nMaker, printed circuit board (PCB)\nMounter, electronic products\nOperator, automatic component assembly\nOperator, backplane and frame wiring\nOperator, coil-winding machine\nOperator, exhaust and sealing machine\nOperator, pick and place machine\nOperator, utility operator\nPicture tube assembler\nPlater, vacuum evaporation process\nPrinter, photoresist\nSemiconductor assembler \/ calibrator\nSetter, exhaust equipment\nTechnician, wafer technician\nTypewriter aligner \/ parts salvager\nWinder, choke \/ condenser\nWire and harness assembler",
    "Career Video URLs": "",
    "Career Videos Content": "",
    "Career Video Link": [
        ""
    ],
    "Education, Training and Skills Content": "<ul><li>Completion of secondary school is usually required for electronics assemblers, fabricators, inspectors and testers.<\/li><li>On-the-job training is usually provided for occupations in this unit group.<\/li><li>A two-year apprenticeship and voluntary trade certification is available for electronics assemblers in Ontario and Saskatchewan.<\/li><li>Electronics testers may require post-secondary courses in basic electronic theory, testing techniques and testing equipment.<\/li><li>Electronics inspectors and testers may require experience as an electronics assembler or component fabricator.<\/li><\/ul><p><\/p>",
    "Education Programs in B.C. Content": "<p>The following program areas are related to this occupation:<\/p><ul><li>Academic\/Basic Upgrading<\/li><\/ul><p><\/p>",
    "Skills Content": "<p>Every job calls for a certain set of skills. Knowing those skills is the first step in finding a good career fit.<\/p><p>Here, you will find the 10 most relevant workplace skills. Some are more important to achieving success in a certain career than others. These skills may come naturally to you or you may need to gain them through education, training and experience.<\/p><p>See the list of work-related skills below, ranked in order of importance for this career. Check out the list and see if this career matches your skills—take that first step!<\/p>",
    "Labour Market Statistics Content": "<p>Discover data, facts and information that have been gathered and analyzed. Learn about the characteristics of the economy and labour market in B.C.<\/p>",
    "Employment Content ": "<p>Find out about employment types and trends by region and industry.<\/p>",
    "Labour Market Outlook Content": "<p>The B.C. Labour Market Outlook is a 10-year forecast of the expected supply and demand for labour in the province. It’s updated every year. The purpose is to provide British Columbians with the knowledge to make informed decisions on careers, skills training, education and hiring.<\/p>",
    "Industry Highlights Content": "<p>Learn about the opportunities in B.C.'s major industries, including employment trends, earning potential, locations of work and more.<\/p>",
    "Insights from Industry Content": "",
    "Resources": [
        {
            "Resource Title": "",
            "Resource Link": ""
        }
    ]
},
{
    "Page Title": "Elementary school and kindergarten teachers",
    "Banner Image": [],
    "NOC": "(NOC 4032)",
    "Career Overview Content": "<p>Elementary school and kindergarten teachers work with children from kindergarten to Grade 7. They teach in core areas such as reading, writing and arithmetic. They may also teach physical education, music and other subjects. Some specialize in second-language instruction.<\/p>",
    "Duties Content": "<p>In general, elementary school and kindergarten teachers:<\/p><ul><li>Use a structured plan of lessons, discussions, audio-visual presentations and field trips along with flexible instruction based on students’ interests<\/li><li>Prepare lessons based on approved curriculum and school district guidelines<\/li><li>Provide or co-ordinate hands-on, practical learning experiences<\/li><li>Lead students in activities to promote their physical, mental and social development<\/li><li>Prepare, give and mark tests and assignments<\/li><li>Monitor students’ progress and discuss with parents<\/li><li>Identify children’s individual learning needs<\/li><li>Manage various learning styles and behaviour types<\/li><li>Work with educational assistants to modify lessons for students needing extra help<\/li><li>Take part in staff meetings, conferences and teacher education workshops<\/li><\/ul><p>Some may also:<\/p><ul><li>Assign and mark homework<\/li><li>Supervise teachers’ aides and student teachers<\/li><\/ul><p>Elementary school and kindergarten teachers may choose to focus on areas such as special education, counselling, music or physical education. Some teach English as a second language (ESL). Others teach in core French or French immersion programs or in B.C.’s francophone school system.<\/p>",
    "Additional Duties List": "",
    "Salary Content": "<p>Earnings is income that workers receive in exchange for their labour. Depending on the type of employment, earnings can be in the form of wages (hourly), salaries (fixed monthly or annual) or self-employed earnings.<\/p>",
    "Work Environment Content": "<p>Elementary school and kindergarten teachers work in public and private elementary schools. They do most of their work in the classroom. Out-of-classroom learning is also an important part of the job. They regularly take care of organizational tasks, prepare lessons and do marking on their own time, often at home.<\/p><p>Most teachers work a 10-month school year, with two months off in July and August. They also have holidays over Christmas and at spring break.<\/p><p>Elementary school and kindergarten teachers use computers to share lessons and information electronically with students and parents. They also teach students how to safely use computers and tablets for in-class work.<\/p><p>Teaching can be a highly rewarding job for those who like to help children. It can also be challenging. Teachers work with students with a variety of learning abilities and needs. They can be faced with difficult issues in the classroom. They may also feel the physical effects of standing and bending throughout the day.<\/p>",
    "Career Pathways Content": "<p>Some new graduates secure teaching contracts right away. But many begin their careers as full- or part-time teachers teaching on call (TTOCs). TTOCs fill in for teachers who are absent–whether for a few hours, a few days, or while taking maternity leave or sabbatical.<\/p><p>Experienced teachers may move on to become education consultants, vice-principals, principals or school district senior managers.<\/p>",
    "Related Careers Content": "<ul><li><a href=\"https:\/\/www.workbc.ca\/Jobs-Careers\/Explore-Careers\/Browse-Career-Profile\/0422\" >School principals and administrators of elementary and secondary education (NOC 0422)<\/a><\/li><li><a href=\"https:\/\/www.workbc.ca\/Jobs-Careers\/Explore-Careers\/Browse-Career-Profile\/4031\" >Secondary school teachers (NOC 4031)<\/a><\/li><li><a href=\"https:\/\/www.workbc.ca\/Jobs-Careers\/Explore-Careers\/Browse-Career-Profile\/4153\" >Family, marriage and other related counsellors (NOC 4153)<\/a><\/li><li><a href=\"https:\/\/www.workbc.ca\/Jobs-Careers\/Explore-Careers\/Browse-Career-Profile\/4214\" >Early childhood educators and assistants (NOC 4214)<\/a><\/li><li><a href=\"https:\/\/www.workbc.ca\/Jobs-Careers\/Explore-Careers\/Browse-Career-Profile\/4215\" >Instructors of persons with disabilities (NOC 4215)<\/a><\/li><li><a href=\"https:\/\/www.workbc.ca\/Jobs-Careers\/Explore-Careers\/Browse-Career-Profile\/5211\" >Library and public archive technicians (NOC 5211)<\/a><\/li><li><a href=\"https:\/\/www.workbc.ca\/Jobs-Careers\/Explore-Careers\/Browse-Career-Profile\/4413\" >Elementary and secondary school teacher assistants (NOC 4413)<\/a><\/li><\/ul><p><\/p>",
    "Related Careers NOCs": "NOC 0422\nNOC 4031\nNOC 4153\nNOC 4214\nNOC 4215\nNOC 5211\nNOC 4413",
    "Occupational Interests Content": "<p>It’s important to understand what kinds of occupations align with your interests.<\/p><p>Here are the top occupational interests for this career profile:<\/p>",
    "Job Titles List": "Elementary school reading clinician\nReading clinician - elementary school\nTeacher, Aboriginal school\nTeacher, art \/ crafts\nTeacher, early childhood education\nTeacher, elementary \/ primary school\nTeacher, English \/ ESL (second language)\nTeacher, French \/ French immersion\nTeacher, home economics (cooking, sewing)\nTeacher, languages\nTeacher, mathematics\nTeacher, music\nTeacher, physical education\nTeacher, remedial\nTeacher, science \/ nature study\nTeacher, special education\nTeacher, substitute \/ supply teacher\nTeacher, technology\nTeacher, visiting teacher\nTeacher-librarian - elementary school",
    "Career Video URLs": "",
    "Career Videos Content": "",
    "Career Video Link": [
        ""
    ],
    "Education, Training and Skills Content": "<p>Elementary school and kindergarten teachers need:<\/p><ul><li>A bachelor’s degree in education<\/li><li>A provincial teaching certificate<\/li><li>Past experience working with children or youth or volunteering in schools<\/li><\/ul><p>Most teachers complete a bachelor's degree in the arts or sciences before earning their bachelor’s degree in education.<\/p><p>Teachers who specialize in special education or second-language instruction need additional training. Those who wish to teach English as a second language (ESL) or French immersion are assessed by their employer.<\/p>",
    "Education Programs in B.C. Content": "<p>The following program areas are related to this occupation:<\/p><ul><li>Elementary\/Secondary Teaching Related<\/li><\/ul><p><\/p>",
    "Skills Content": "<p>Every job calls for a certain set of skills. Knowing those skills is the first step in finding a good career fit.<\/p><p>Here, you will find the 10 most relevant workplace skills. Some are more important to achieving success in a certain career than others. These skills may come naturally to you or you may need to gain them through education, training and experience.<\/p><p>See the list of work-related skills below, ranked in order of importance for this career. Check out the list and see if this career matches your skills—take that first step!<\/p>",
    "Labour Market Statistics Content": "<p>Discover data, facts and information that have been gathered and analyzed. Learn about the characteristics of the economy and labour market in B.C.<\/p>",
    "Employment Content ": "<p>Find out about employment types and trends by region and industry.<\/p>",
    "Labour Market Outlook Content": "<p>The B.C. Labour Market Outlook is a 10-year forecast of the expected supply and demand for labour in the province. It’s updated every year. The purpose is to provide British Columbians with the knowledge to make informed decisions on careers, skills training, education and hiring.<\/p>",
    "Industry Highlights Content": "<p>Learn about the opportunities in B.C.'s major industries, including employment trends, earning potential, locations of work and more.<\/p>",
    "Insights from Industry Content": "<p>Elementary school and kindergarten teachers enjoy strong job prospects.<\/p><p>Demand is especially high for French immersion and francophone program teachers who usually find teaching contracts in their first year of work. Demand is also very strong for teachers in rural areas.<\/p>",
    "Resources": [
        {
            "Resource Title": "",
            "Resource Link": ""
        }
    ]
},
{
    "Page Title": "Elevator constructors and mechanics",
    "Banner Image": [],
    "NOC": "(NOC 7318)",
    "Career Overview Content": "<p><strong>Elevator constructors and mechanics:<\/strong><\/p><ul><li>Assemble, install, maintain and repair freight and passenger elevators, escalators, moving walkways and other related equipment<\/li><li>Work for elevator construction and maintenance companies<\/li><\/ul><p><\/p>",
    "Duties Content": "<p><strong>Elevator constructors and mechanics:<\/strong><\/p><ul><li>Read and interpret blueprints to determine layout of system components<\/li><li>Do preparatory construction work including steel work, wiring and piping<\/li><li>Install elevators, escalators, moving walkways, dumbwaiters and related equipment according to specifications<\/li><li>Connect car frames to counterweights with cables and assemble elevator cars<\/li><li>Install and wire electric and electronic control system devices<\/li><li>Install, test and adjust safety control devices<\/li><li>Test operation of newly installed equipment<\/li><li>Troubleshoot electrical or mechanical systems failures<\/li><li>Take apart defective units and repair or replace worn or faulty parts<\/li><li>Adjust valves, ratchets, seals, brake linings and other components<\/li><li>Carry out preventative maintenance programs to make sure the public is safe<\/li><\/ul><h2>Special duties<\/h2><p>Elevator constructors and mechanics may specialize in construction, maintenance or repair.<\/p>",
    "Additional Duties List": "",
    "Salary Content": "<p>Earnings is income that workers receive in exchange for their labour. Depending on the type of employment, earnings can be in the form of wages (hourly), salaries (fixed monthly or annual) or self-employed earnings.<\/p>",
    "Work Environment Content": "<p><strong>Key aspects of the work in this occupation:<\/strong><\/p><ul><li>Work takes place in a controlled indoor environment.<\/li><li>Working with equipment, machinery or power\/hand tools may be a source of injury.<\/li><li>The workplace may be hazardous and pose a risk of injury.<\/li><\/ul><p><\/p>",
    "Career Pathways Content": "<p>Progression to supervisory positions is possible with experience.<\/p>",
    "Related Careers Content": "<ul><li><a href=\"https:\/\/www.workbc.ca\/Jobs-Careers\/Explore-Careers\/Browse-Career-Profile\/2262\" >Engineering inspectors and regulatory officers (NOC 2262)<\/a><\/li><li><a href=\"https:\/\/www.workbc.ca\/Jobs-Careers\/Explore-Careers\/Browse-Career-Profile\/7301\" >Contractors and supervisors, mechanic trades (NOC 7301)<\/a><\/li><\/ul><p><\/p>",
    "Related Careers NOCs": "NOC 2262\nNOC 7301",
    "Occupational Interests Content": "<p>It’s important to understand what kinds of occupations align with your interests.<\/p><p>Here are the top occupational interests for this career profile:<\/p>",
    "Job Titles List": "Elevator builder \/ installer \/ repairer\nEscalator builder \/ installer \/ repairer\nInstaller-repairer, dumbwaiter\nInstaller-repairer, moving walkway\nJourneyman \/ journeywoman elevator mechanic\nMechanic, elevating device",
    "Career Video URLs": "",
    "Career Videos Content": "",
    "Career Video Link": [
        ""
    ],
    "Education, Training and Skills Content": "<ul><li>Completion of secondary school is usually required.<\/li><li>Completion of a four- to five-year apprenticeship program or Acombination of over four years of work experience in the trade and some high school, college or industry courses in elevator construction or repair is usually required to be eligible for trade certification.<\/li><li>Elevator constructor and mechanic trade certification is compulsory in Quebec and Alberta and available, but voluntary, in British Columbia, the Northwest Territories and Nunavut.<\/li><\/ul><p>For more information please see the Industry Training Authority website at <a href=\"http:\/\/www.itabc.ca\/\"  target=\"_blank\" rel=\"noopener noreferrer\">www.itabc.ca.<\/a><\/p><p>Elevating device mechanics who are certified for that occupation by a regulator elsewhere in Canada can apply for the same certification from the regulator in B.C. Under the terms of the <a href=\"https:\/\/www.cfta-alec.ca\/\"  target=\"_blank\" rel=\"noopener noreferrer\">Canadian Free Trade Agreement (CFTA)<\/a>, most applicants who are transferring their credentials from elsewhere in Canada will not be required to complete additional training or testing. However, the B.C. regulator may ask applicants to provide further information such as a letter of good standing, references, or criminal record check.<br\/><br\/>For those who trained outside of Canada and never received certification from any Canadian jurisdiction, a full assessment is likely needed. Most occupational regulators have a process for assessment and recognize internationally trained applicants.<br\/><br\/>Contact the <a href=\"https:\/\/www.technicalsafetybc.ca\/\"  target=\"_blank\" rel=\"noopener noreferrer\">Technical Safety BC<\/a> for details on how to apply for certification in B.C.<br\/><br\/>For information about labour mobility in Canada, visit <a href=\"http:\/\/www.workersmobility.ca\/\"  target=\"_blank\" rel=\"noopener noreferrer\">www.workersmobility.ca<\/a>.<br\/><br\/>View a list of <a href=\"https:\/\/www.workbc.ca\/Jobs-Careers\/Explore-Careers\/B-C-Occupational-Regulators.aspx\" >B.C. occupational regulators<\/a>.<\/p>",
    "Education Programs in B.C. Content": "",
    "Skills Content": "<p>Every job calls for a certain set of skills. Knowing those skills is the first step in finding a good career fit.<\/p><p>Here, you will find the 10 most relevant workplace skills. Some are more important to achieving success in a certain career than others. These skills may come naturally to you or you may need to gain them through education, training and experience.<\/p><p>See the list of work-related skills below, ranked in order of importance for this career. Check out the list and see if this career matches your skills—take that first step!<\/p>",
    "Labour Market Statistics Content": "<p>Discover data, facts and information that have been gathered and analyzed. Learn about the characteristics of the economy and labour market in B.C.<\/p>",
    "Employment Content ": "<p>Find out about employment types and trends by region and industry.<\/p>",
    "Labour Market Outlook Content": "<p>The B.C. Labour Market Outlook is a 10-year forecast of the expected supply and demand for labour in the province. It’s updated every year. The purpose is to provide British Columbians with the knowledge to make informed decisions on careers, skills training, education and hiring.<\/p>",
    "Industry Highlights Content": "<p>Learn about the opportunities in B.C.'s major industries, including employment trends, earning potential, locations of work and more.<\/p>",
    "Insights from Industry Content": "",
    "Resources": [
        {
            "Resource Title": "",
            "Resource Link": ""
        }
    ]
},
{
    "Page Title": "Employment insurance, immigration, border services and revenue officers",
    "Banner Image": [],
    "NOC": "(NOC 1228)",
    "Career Overview Content": "<p>Employment insurance, immigration border service and revenue officers work for government agencies.<\/p><p>This occupation includes government officers who carry out and enforce laws and regulations related to immigration, employment insurance, customs and tax revenue.<\/p>",
    "Duties Content": "<p><strong>Employment insurance officers perform some or all of the following duties:<\/strong><\/p><ul><li>Determine the eligibility of persons applying for employment insurance benefits<\/li><li>Ascertain the facts on such issues as reasons for loss of employment and availability for work<\/li><li>Monitor the payments of benefits throughout the duration of a claim and investigate claimants when there appears to be fraud or abuse.<\/li><\/ul><p><strong>Immigration officers perform some or all of the following duties:<\/strong><\/p><ul><li>Determine admissibility of persons seeking entry into Canada by examining documents and conducting interviews<\/li><li>Grant landed-immigrant status, admit persons or order detention or deportation<\/li><li>Locate and apprehend persons presumed to be infringing on immigration laws<\/li><li>Assist in the removal of deported people by seeking authorization from receiving countries and securing necessary travel documents<\/li><li>Appear as a witness in cases related to immigration appeals.<\/li><\/ul><p><strong>Border services officers and customs inspectors perform some or all of the following duties:<\/strong><\/p><ul><li>Question persons at border points to determine the admissibility of goods and assess duty<\/li><li>Inspect baggage to detect undeclared merchandise, or contraband<\/li><li>Inform manufacturers and shippers of customs and laws and procedures<\/li><li>Observe fabrication of articles affected by customs laws and conduct appraisals<\/li><li>Board carriers arriving from foreign countries to determine nature of cargo to ensure compliance with customs and commerce laws<\/li><li>Inspect goods imported by mail<\/li><li>May arrest and detain individuals suspected of having committed a criminal offence under the Customs Act or certain other designated Criminal Code offences until police intervention is possible.<\/li><\/ul><p><strong>Excise tax revenue officers perform some or all of the following duties:<\/strong><\/p><ul><li>Audit accounting records to determine income, exemptions, payable taxes, compliance with reporting regulations and existence of fraud<\/li><li>Examine accounting systems and internal controls of organizations<\/li><li>Provide advice on reporting and evaluation methods for goods subject to taxation<\/li><li>Prepare briefs and assist in searching and seizing records, and in preparing charges for court cases.<\/li><\/ul><p><\/p>",
    "Additional Duties List": "",
    "Salary Content": "<p>Earnings is income that workers receive in exchange for their labour. Depending on the type of employment, earnings can be in the form of wages (hourly), salaries (fixed monthly or annual) or self-employed earnings.<\/p>",
    "Work Environment Content": "<p>Work in this occupation is typically performed in a structured environment, such as an office.<\/p>",
    "Career Pathways Content": "<p>Promotion to senior management positions is possible with experience.<\/p>",
    "Related Careers Content": "<ul><li><a href=\"https:\/\/www.workbc.ca\/Jobs-Careers\/Explore-Careers\/Browse-Career-Profile\/0411\" >Government managers - health and social policy development and program administration (NOC 0411)<\/a><\/li><li><a href=\"https:\/\/www.workbc.ca\/Jobs-Careers\/Explore-Careers\/Browse-Career-Profile\/0412\" >Government managers - economic analysis, policy development and program administration (NOC 0412)<\/a><\/li><li><a href=\"https:\/\/www.workbc.ca\/Jobs-Careers\/Explore-Careers\/Browse-Career-Profile\/1111\" >Financial auditors and accountants (NOC 1111)<\/a><\/li><li><a href=\"https:\/\/www.workbc.ca\/Jobs-Careers\/Explore-Careers\/Browse-Career-Profile\/1114\" >Other financial officers (NOC 1114)<\/a><\/li><li><a href=\"https:\/\/www.workbc.ca\/Jobs-Careers\/Explore-Careers\/Browse-Career-Profile\/4164\" >Social policy researchers, consultants and program officers (NOC 4164)<\/a><\/li><\/ul><p><\/p>",
    "Related Careers NOCs": "NOC 0411\nNOC 0412\nNOC 1111\nNOC 1114\nNOC 4164",
    "Occupational Interests Content": "<p>It’s important to understand what kinds of occupations align with your interests.<\/p><p>Here are the top occupational interests for this career profile:<\/p>",
    "Job Titles List": "Adjudicator, claims\nAgent, collection\nAppeal judge\nAuditor, tax office\nBenefits officer - government services\nBusiness expertise advisor - government services\nBusiness expertise consultant - government services\nCitizen services officer (CSO) - government services\nCollector, customs \/ excise \/ city tax\nExaminer, citizenship \/ immigration\nExaminer, customs & excise\nIntegrity services investigator - government services\nIntegrity services investigator - Service Canada\nIntegrity services officer - government services\nInvestigator, tax \/ benefit claims\nOfficer, claims adjudication\nOfficer, customs \/ excise duty\nOfficer, immigraton case review \/ appeals\nOfficer, tax \/ tax appeal \/ collection\nPayment service officer - government services\nTax auditors team leader",
    "Career Video URLs": "https:\/\/youtu.be\/F9b2s14K9cc",
    "Career Videos Content": "<p>Watch the video below to see what a program advisor does in a day.<\/p>",
    "Career Video Link": [
        ""
    ],
    "Education, Training and Skills Content": "<ul><li>A bachelor's degree or college diploma is usually required.<\/li><li>Several years of related administrative or regulatory experience may be required.<\/li><li>Completion of specialized government training is required.<\/li><\/ul><p><\/p>",
    "Education Programs in B.C. Content": "<p>The following program areas are related to this occupation:<\/p><ul><li>Criminal Justice\/Criminology<\/li><li>Criminology\/Criminal Justice<\/li><\/ul><p><\/p>",
    "Skills Content": "<p>Every job calls for a certain set of skills. Knowing those skills is the first step in finding a good career fit.<\/p><p>Here, you will find the 10 most relevant workplace skills. Some are more important to achieving success in a certain career than others. These skills may come naturally to you or you may need to gain them through education, training and experience.<\/p><p>See the list of work-related skills below, ranked in order of importance for this career. Check out the list and see if this career matches your skills—take that first step!<\/p>",
    "Labour Market Statistics Content": "<p>Discover data, facts and information that have been gathered and analyzed. Learn about the characteristics of the economy and labour market in B.C.<\/p>",
    "Employment Content ": "<p>Find out about employment types and trends by region and industry.<\/p>",
    "Labour Market Outlook Content": "<p>The B.C. Labour Market Outlook is a 10-year forecast of the expected supply and demand for labour in the province. It’s updated every year. The purpose is to provide British Columbians with the knowledge to make informed decisions on careers, skills training, education and hiring.<\/p>",
    "Industry Highlights Content": "<p>Learn about the opportunities in B.C.'s major industries, including employment trends, earning potential, locations of work and more.<\/p>",
    "Insights from Industry Content": "",
    "Resources": [
        {
            "Resource Title": "",
            "Resource Link": ""
        }
    ]
}
]
